LEXICON_RU: dict[str, str] = {
    '/start': 'Введите Ваше имя\n'
              '<i>Имя должно быть уникальным</i>',
    'order': 'Заказать!',
    'other_answer': 'Извини, увы, это сообщение мне непонятно...',
    'login_true':'Такой логин уже существует\n'
                 'Попробуйте еще раз',
    'login_false':'Добро пожаловать, ',
    'login_user_true': 'Добро пожаловать, ',
    'login_user_false': 'Вы указали не верный логин',
    'back': 'НАЗАД',
    'universe': 'Выбрать вселенную',
    'add_card': 'Получить карту',
    'my_cards': 'Мои карты'}

LEXICON_ADMIN = {'backward': '◀️',
           'forward': '▶️'}


LEXICON_CARD: dict[str:str] = {
    'card':'Карточки',
    'add_card': 'Добавить карточку',
    'universe':'Вселенные',
    'add_inuverse': 'Добавить вселенную',
    'add_attempt': 'Выдача попыток',
    'rere': '🏆 Редкость: ',
    'attack': '🗡 Атака: ',
    'health': '❤️ Здоровье: ',
    'value': '🔖 Раритетность: ',
    'promo': 'Промокоды',
    'mailing': 'Рассылка',

}


LEXICON_PROMO: dict[str:str] = {
    'add':'➕Добавить',
    'listPromo':'👁‍🗨действующие промокоды',
}

LEXICON_CARD_RARE: dict[str:str] = {
    'usual':'🃏Обычная',
    'rare': '🍃Редкая',
    'epic':'👾Эпическая',
    'mythical': '🎴Мифическая',
    'legendary': '💮Легендарная',

}

LIXICON_UNIVERSE: dict[str:str] = {
    'choice':'🪐Выбирите вселенную',
    'rare': '🍃Редкая',
    'epic':'👾Эпическая',
    'mythical': '🎴Мифическая',
    'legendary': '💮Легендарная'
}

LEXICON_SHOP: dict[str:str] = {
    'shop':'🏬МАГАЗИН',
    '1_attempt': '1 попытка - 75 пыли🌸',
    '20_attempt':'20 попыток - 1500 пыли🌸',
    '100_attempt':'100 попыток - 7500 пыли🌸'
}

LEXICON_ARENA: dict[str:str] = {
    'search':'🔍Поиск игры',
    'no_search': '🚫 Сначала собери команду',
    'teams':'📣 Команда',
    'statistics':'📈 Сатистика'
}